# MaterialParamShininess Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MaterialParamShininess Property
ParameterTypeId Class See Also
---
"Shininess"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MaterialParamShininess { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MaterialParamShininess As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MaterialParamShininess {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace